from bs4 import BeautifulSoup
import requests
from main import text_to_image


# parser url 
def Namozregion():
    url ='https://islom.uz/region/1'
    response = requests.get(url)
    soup = BeautifulSoup(response.text, 'html.parser')
    regions = soup.find('div', class_ = "custom-select")
    print(regions)
    region = {"region_name":[]}
    k=0
    for i in regions.find('select').find_all('option'):
        k = +1
        region["region_name"].append({f'{i.text}':i['value']})
    return region
# print(Namozregion())

def parser_url(city):
	data ={'region_name': 
    {'Андижон': '1', 'Бухоро': '4', 'Гулистон': '5',  
    'Навоий': '14', 'Наманган': '15', 'Нукус': '16', 
    'Самарқанд': '18', 'Термиз': '74', 'Тошкент': '27',  
    'Фарғона': '37',  'Хива': '21',  'Қарши': '93', 
    'Қарши': '25', 'Жиззах': '9'}
    }
	data_city = {"Андижон":"Andijon", "Бухоро":"Buxoro", "Гулистон":"Sirdaryo", 
	"Навоий":"Navoiy", "Наманган":"Namangan", "Нукус":"Qoraqalpog'iston", 
	"Самарқанд":"Samarqand", "Термиз":"Surxondaryo", "Тошкент":"Toshkent", 
	"Фарғона":"Farg'ona", "Хива":"Xorazim", "Қарши":"Qashqadaryo",'Жиззах': 'Jizzax'}

	url = f'https://islom.uz/region/{data["region_name"][city]}'
	response = requests.get(url)
	soup = BeautifulSoup(response.text, 'html.parser')
	bomdod = soup.find('div', id = "tc1").text
	quyosh = soup.find('div', id = "tc2").text
	peshin = soup.find('div', id = "tc3").text
	asr = soup.find('div', id = "tc4").text
	shom = soup.find('div', id = "tc5").text
	xufton = soup.find('div', id = "tc6").text

	text_to_image(data_city[city],bomdod, quyosh, peshin, asr, shom, xufton, "Ubuntu-Medium.ttf", 30, (251,240,147))

# print(parser_url())



[{'Ангрен': '43'}, {'Андижон': '1'}, {'Арнасой': '52'}, 
 {'Ашхабод': '90'}, {'Бекобод': '2'}, {'Бишкек': '3'}, {'Бойсун': '76'}, 
 {'Булоқбоши': '73'}, {'Бурчмулла': '44'}, {'Бухоро': '4'}, {'Газли': '46'}, 
 {'Гулистон': '5'}, {'Денов': '6'}, {'Деҳқонобод': '84'}, {'Дўстлик': '51'}, 
 {'Душанбе': '89'}, {'Жалолобод': '7'}, {'Жамбул': '8'}, {'Жиззах': '9'}, {'Жомбой': '10'},
{'Зарафшон': '61'}, {'Зомин': '50'}, {'Каттақўрғон': '11'}, {'Конибодом': '12'},
{'Конимех': '59'}, {'Косон': '86'}, {'Косонсой': '34'}, {'Марғилон': '13'},
{'Мингбулоқ': '64'}, {'Муборак': '88'}, {'Мўйноқ': '68'}, {'Навоий': '14'},
{'Наманган': '15'}, {'Нукус': '16'}, {'Нурота': '17'}, {'Олмаота': '41'}, 
{'Олот': '45'}, {'Олтиариқ': '38'}, {'Олтинкўл': '69'}, {'Пахтаобод': '49'},
{'Поп': '32'}, {'Риштон': '39'}, {'Сайрам': '42'}, {'Самарқанд': '18'}, 
{'Таллимаржон': '87'}, {'Тахтакўпир': '66'}, {'Термиз': '74'}, {'Томди': '58'}, 
 {'Тошкент': '27'}, {'Тошҳовуз': '92'}, {'Туркистон': '19'}, {'Туркманобод': '91'},
 {'Тўрткўл': '65'}, {'Узунқудуқ': '62'}, {'Урганч': '78'}, {'Ургут': '72'}, 
 {'Ўсмат': '53'}, {'Учтепа': '56'}, {'Учқудуқ': '63'}, {'Учқўрғон': '36'}, {'Ўш': '20'}, 
 {'Ўғиз': '57'}, {'Фарғона': '37'}, {'Хазорасп': '79'}, {'Хива': '21'}, 
 {'Хонобод': '31'}, {'Хонқа': '80'}, {'Хўжанд': '22'}, {'Хўжаобод': '29'}, 
 {'Чимбой': '67'}, {'Чимкент': '23'}, {'Чортоқ': '35'}, {'Чуст': '33'}, {'Шаҳрихон': '28'}, 
 {'Шеробод': '77'}, {'Шовот': '82'}, {'Шуманай': '70'}, {'Янгибозор': '81'}, 
 {'Ғаллаорол': '55'}, {'Ғузор': '85'}, {'Қарши': '93'}, {'Қарши': '25'}, 
 {'Қизилтепа': '60'}, {'Қоракўл': '48'}, {'Қоровулбозор': '47'}, {'Қува': '40'}, {
     'Қумқўрғон': '75'}, 
 {'Қўнғирот': '71'}, {'Қўрғонтепа': '30'}, {'Қўқон': '26'}]